---
kind: type
id: T:Autodesk.Revit.DB.ExternalResourceSubFolder
source: html/b9b20e80-9af0-557b-7a3e-a35168c5eab0.htm
---
# Autodesk.Revit.DB.ExternalResourceSubFolder

Data that describes a remote folder to be shown in the file browser dialog

## Syntax (C#)
```csharp
public class ExternalResourceSubFolder : IDisposable
```